cmsis-svd/cmsis-svd/data/HDSC/HC32L150FX.svd
                <register>
                    <name>INT_PEND</name>
                    <description>desc INT_PEND</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>MAIN</name>
                            <description>desc MAIN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SUB</name>
                            <description>desc SUB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MCSVI</name>
                            <description>desc MCSVI</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCSVI</name>
                            <description>desc SCSVI</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FCS</name>
                            <description>desc FCS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CLR</name>
                    <description>desc INT_CLR</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>MAIN</name>
                            <description>desc MAIN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SUB</name>
                            <description>desc SUB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCSVC</name>
                            <description>desc MCSVC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCSVC</name>
                            <description>desc SCSVC</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FCS</name>
                            <description>desc FCS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CTIOSEL03</name>
            <description>desc CTIOSEL03</description>
            <baseAddress>0x40025100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTSEL0123</name>
                    <description>desc CTSEL0123</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>SEL01</name>
                            <description>desc SEL01</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL23</name>
                            <description>desc SEL23</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CTIOSEL47</name>
            <description>desc CTIOSEL47</description>
            <baseAddress>0x40025300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTSEL4567</name>
                    <description>desc CTSEL4567</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>SEL45</name>
                            <description>desc SEL45</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL67</name>
                            <description>desc SEL67</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
